In [4]:
import pandas as pd

In [5]:
arr = [
  [1, 6, 2, 10],
  [8, 9, 4, 11],
  [9, 8, 7, 12],
  [1, 6, 3, 20],
]

idx = [0, 1]

In [6]:
df= pd.DataFrame(arr)

In [7]:
df.head()

   0  1  2   3
0  1  6  2  10
1  8  9  4  11
2  9  8  7  12
3  1  6  3  20

In [8]:
df2= df.groupby(idx).agg(['sum'])

In [9]:
df2

      2   3
    sum sum
0 1
1 6   5  30
8 9   4  11
9 8   7  12

In [10]:
value= df2.values.tolist()

In [11]:
value

[[5, 30], [4, 11], [7, 12]]

In [12]:
keys= df2.index.tolist()

In [13]:
keys

[(1, 6), (8, 9), (9, 8)]

In [14]:
dicc= dict(zip(keys,value))

In [15]:
dicc

{(1, 6): [5, 30], (8, 9): [4, 11], (9, 8): [7, 12]}

In [16]:
type(keys)

list

In [28]:
def group(arr, idx):
    import pandas as pd
    df= pd.DataFrame(arr)
    df2= df.groupby(idx).agg('sum')  
    value= df2.values.tolist()
    #keys= [tuple(key,) for val in df2.index.to_list()]
    #keys= tuple(df2.index)
    keys = [tuple([key]) if isinstance(key, int) else key for key in df2.index]
    dicc= dict(zip(keys,value))
    return dicc
#Uso la función insistance para comprobar si es un nº entero o no porque al ser solo una columna, no lo devuelve como tupla.

In [29]:
group([[1,1,1],[1,2,1],[1,3,1]],[0,2])

{(1, 1): [6]}

In [31]:
group([[1,2,3],[1,5,6],[1,8,9]],[0])

{(1,): [15, 18]}